benchmark testing/load_workloada_hbase.txt
/usr/bin/java  -classpath /home/alec_fei/ycsb-0.17.0/conf:/home/alec_fei/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/home/alec_fei/ycsb-0.17.0/lib/core-0.17.0.jar:/home/alec_fei/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/home/alec_fei/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/home/alec_fei/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/home/alec_fei/ycsb-0.17.0/lib/mysql-connector-j-8.0.32.jar:/home/alec_fei/ycsb-0.17.0/hbase20-binding/lib/audience-annotations-0.5.0.jar:/home/alec_fei/ycsb-0.17.0/hbase20-binding/lib/commons-logging-1.1.3.jar:/home/alec_fei/ycsb-0.17.0/hbase20-binding/lib/findbugs-annotations-1.3.9-1.jar:/home/alec_fei/ycsb-0.17.0/hbase20-binding/lib/hbase-shaded-client-2.0.0.jar:/home/alec_fei/ycsb-0.17.0/hbase20-binding/lib/hbase10-binding-0.17.0.jar:/home/alec_fei/ycsb-0.17.0/hbase20-binding/lib/hbase20-binding-0.17.0.jar:/home/alec_fei/ycsb-0.17.0/hbase20-binding/lib/htrace-core4-4.1.0-incubating.jar:/home/alec_fei/ycsb-0.17.0/hbase20-binding/lib/log4j-1.2.17.jar:/home/alec_fei/ycsb-0.17.0/hbase20-binding/lib/slf4j-api-1.7.25.jar site.ycsb.Client -load -db site.ycsb.db.hbase20.HBaseClient20 -p table=usertable -p columnfamily=family -s -P workloads/workloada
[OVERALL], RunTime(ms), 36044
[OVERALL], Throughput(ops/sec), 277.43868605038284
[TOTAL_GCS_PS_Scavenge], Count, 9
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 146
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.40506048163355896
[TOTAL_GCS_PS_MarkSweep], Count, 1
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 47
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.13039618244367995
[TOTAL_GCs], Count, 10
[TOTAL_GC_TIME], Time(ms), 193
[TOTAL_GC_TIME_%], Time(%), 0.5354566640772389
[CLEANUP], Operations, 2
[CLEANUP], AverageLatency(us), 164550.0
[CLEANUP], MinLatency(us), 12
[CLEANUP], MaxLatency(us), 329215
[CLEANUP], 95thPercentileLatency(us), 329215
[CLEANUP], 99thPercentileLatency(us), 329215
[INSERT], Operations, 10000
[INSERT], AverageLatency(us), 3168.5578
[INSERT], MinLatency(us), 462
[INSERT], MaxLatency(us), 789503
[INSERT], 95thPercentileLatency(us), 8463
[INSERT], 99thPercentileLatency(us), 28799
[INSERT], Return=OK, 10000