benchmark testing/output_workloada_cassandra.txt
/usr/bin/java  -classpath /home/alec_fei/ycsb-0.17.0/conf:/home/alec_fei/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/home/alec_fei/ycsb-0.17.0/lib/core-0.17.0.jar:/home/alec_fei/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/home/alec_fei/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/home/alec_fei/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/home/alec_fei/ycsb-0.17.0/lib/mysql-connector-j-8.0.32.jar:/home/alec_fei/ycsb-0.17.0/cassandra-binding/lib/cassandra-binding-0.17.0.jar:/home/alec_fei/ycsb-0.17.0/cassandra-binding/lib/cassandra-driver-core-3.0.0.jar:/home/alec_fei/ycsb-0.17.0/cassandra-binding/lib/guava-16.0.1.jar:/home/alec_fei/ycsb-0.17.0/cassandra-binding/lib/metrics-core-3.1.2.jar:/home/alec_fei/ycsb-0.17.0/cassandra-binding/lib/netty-buffer-4.0.33.Final.jar:/home/alec_fei/ycsb-0.17.0/cassandra-binding/lib/netty-codec-4.0.33.Final.jar:/home/alec_fei/ycsb-0.17.0/cassandra-binding/lib/netty-common-4.0.33.Final.jar:/home/alec_fei/ycsb-0.17.0/cassandra-binding/lib/netty-handler-4.0.33.Final.jar:/home/alec_fei/ycsb-0.17.0/cassandra-binding/lib/netty-transport-4.0.33.Final.jar:/home/alec_fei/ycsb-0.17.0/cassandra-binding/lib/slf4j-api-1.7.25.jar site.ycsb.Client -load -db site.ycsb.db.CassandraCQLClient -p hosts=127.0.0.1 -s -P workloads/workloada
[OVERALL], RunTime(ms), 66657
[OVERALL], Throughput(ops/sec), 150.02175315420735
[TOTAL_GCS_PS_Scavenge], Count, 27
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 192
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.2880417660560781
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 27
[TOTAL_GC_TIME], Time(ms), 192
[TOTAL_GC_TIME_%], Time(%), 0.2880417660560781
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2257920.0
[CLEANUP], MinLatency(us), 2256896
[CLEANUP], MaxLatency(us), 2258943
[CLEANUP], 95thPercentileLatency(us), 2258943
[CLEANUP], 99thPercentileLatency(us), 2258943
[INSERT], Operations, 10000
[INSERT], AverageLatency(us), 5997.0495
[INSERT], MinLatency(us), 417
[INSERT], MaxLatency(us), 10346495
[INSERT], 95thPercentileLatency(us), 16119
[INSERT], 99thPercentileLatency(us), 32335
[INSERT], Return=OK, 10000