benchmark testing/output_workloada_mongodb.txt
/usr/bin/java  -classpath /home/alec_fei/ycsb-0.17.0/conf:/home/alec_fei/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/home/alec_fei/ycsb-0.17.0/lib/core-0.17.0.jar:/home/alec_fei/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/home/alec_fei/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/home/alec_fei/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/home/alec_fei/ycsb-0.17.0/lib/mysql-connector-j-8.0.32.jar:/home/alec_fei/ycsb-0.17.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/home/alec_fei/ycsb-0.17.0/mongodb-binding/lib/logback-core-1.1.2.jar:/home/alec_fei/ycsb-0.17.0/mongodb-binding/lib/mongo-java-driver-3.8.0.jar:/home/alec_fei/ycsb-0.17.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/home/alec_fei/ycsb-0.17.0/mongodb-binding/lib/mongodb-binding-0.17.0.jar:/home/alec_fei/ycsb-0.17.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/home/alec_fei/ycsb-0.17.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar site.ycsb.Client -load -db site.ycsb.db.MongoDbClient -s -P workloads/workloada
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
[OVERALL], RunTime(ms), 14789
[OVERALL], Throughput(ops/sec), 676.178240584218
[TOTAL_GCS_G1_Young_Generation], Count, 12
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 164
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.1089323145581176
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 12
[TOTAL_GC_TIME], Time(ms), 164
[TOTAL_GC_TIME_%], Time(%), 1.1089323145581176
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3259.0
[CLEANUP], MinLatency(us), 3258
[CLEANUP], MaxLatency(us), 3259
[CLEANUP], 95thPercentileLatency(us), 3259
[CLEANUP], 99thPercentileLatency(us), 3259
[INSERT], Operations, 10000
[INSERT], AverageLatency(us), 908.2768
[INSERT], MinLatency(us), 181
[INSERT], MaxLatency(us), 836607
[INSERT], 95thPercentileLatency(us), 2253
[INSERT], 99thPercentileLatency(us), 11823
[INSERT], Return=OK, 10000